[
  {
    "id": 1,
    "username": "marine",
    "password": "$2b$10$Ao4lHdMDgH6ueNVOMNguv.H4NwMbcHOcBJZJCT0B4kAVWhZHjc.IC",
    "currency": 115,
    "collection": [
      {
        "id": 23,
        "name": "Abo",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, ressemblant à un serpent, souvent vu enroulé sur lui-même.",
        "nb": 1
      },
      {
        "id": 63,
        "name": "Abra",
        "rarity": "common",
        "description": "Un Pokémon de type Psychique, connu pour sa capacité à se téléporter dès qu'il se sent menacé.",
        "nb": 2
      },
      {
        "id": 13,
        "name": "Aspicot",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte et Poison, ressemblant à une petite chenille avec des épines sur son dos.",
        "nb": 2
      },
      {
        "id": 70,
        "name": "Boustiflor",
        "rarity": "common",
        "description": "L'évolution de Chétiflor, un Pokémon avec des pétales plus gros et un caractère plus agressif, capable de libérer des spores toxiques.",
        "nb": 1
      },
      {
        "id": 1,
        "name": "Bulbizarre",
        "rarity": "common",
        "description": "Un Pokémon de type Plante et Poison, souvent vu avec un bulbe sur son dos qui deviendra une grande fleur.",
        "nb": 5
      },
      {
        "id": 58,
        "name": "Caninos",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu, ressemblant à un chien, avec une fourrure chaude et une personnalité amicale.",
        "nb": 1
      },
      {
        "id": 8,
        "name": "Carabaffe",
        "rarity": "common",
        "description": "L'évolution de Carapuce, une tortue plus grande et plus robuste.",
        "nb": 3
      },
      {
        "id": 7,
        "name": "Carapuce",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une petite tortue avec une coquille solide.",
        "nb": 5
      },
      {
        "id": 10,
        "name": "Chenipan",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte, ressemblant à une chenille verte, souvent trouvé dans des endroits boisés.",
        "nb": 4
      },
      {
        "id": 69,
        "name": "Chétiflor",
        "rarity": "common",
        "description": "Un Pokémon de type Plante, ressemblant à une petite plante fleurie, souvent trouvé dans les prairies et les bois.",
        "nb": 3
      },
      {
        "id": 11,
        "name": "Chrysacier",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte, souvent vu sous forme de cocon avant de se transformer en Papilusion.",
        "nb": 5
      },
      {
        "id": 14,
        "name": "Coconfort",
        "rarity": "common",
        "description": "L'évolution d'Aspicot, un cocon solide qui protège l'insecte avant sa métamorphose en Dardargnan.",
        "nb": 6
      },
      {
        "id": 84,
        "name": "Doduo",
        "rarity": "common",
        "description": "Un Pokémon à deux têtes et à deux corps, de type Normal et Vol, qui court à une vitesse incroyable.",
        "nb": 1
      },
      {
        "id": 133,
        "name": "Évoli",
        "rarity": "common",
        "description": "Un Pokémon de type Normal, capable d'évoluer en plusieurs formes selon le type d'évolution choisi par son dresseur.",
        "nb": 3
      },
      {
        "id": 92,
        "name": "Fantominus",
        "rarity": "common",
        "description": "Un Pokémon de type Spectre et Poison, ressemblant à un fantôme qui flotte dans les airs et peut traverser les murs.",
        "nb": 1
      },
      {
        "id": 56,
        "name": "Férosinge",
        "rarity": "common",
        "description": "Un Pokémon de type Combat, ressemblant à un petit singe, agile et toujours prêt à se battre.",
        "nb": 1
      },
      {
        "id": 37,
        "name": "Goupix",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu ressemblant à un renard, avec une queue touffue et une fourrure chaude.",
        "nb": 2
      },
      {
        "id": 75,
        "name": "Gravalanch",
        "rarity": "common",
        "description": "L'évolution de Racaillou, plus imposant et plus solide, avec des pierres pointues recouvrant son corps.",
        "nb": 3
      },
      {
        "id": 2,
        "name": "Herbizarre",
        "rarity": "common",
        "description": "L'évolution de Bulbizarre, un Pokémon à l'apparence plus végétale avec des branches florales.",
        "nb": 3
      },
      {
        "id": 116,
        "name": "Hypotrempe",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une petite créature aquatique, qui se déplace en glissant dans l'eau.",
        "nb": 8
      },
      {
        "id": 64,
        "name": "Kadabra",
        "rarity": "common",
        "description": "L'évolution d'Abra, un Pokémon avec des pouvoirs psychiques beaucoup plus développés, capable de lancer des attaques puissantes.",
        "nb": 1
      },
      {
        "id": 90,
        "name": "Kokiyas",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une coquille, qui se cache à l'intérieur de son coquillage pour se protéger.",
        "nb": 1
      },
      {
        "id": 98,
        "name": "Krabby",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un crabe, qui vit sur les plages et se cache sous les rochers.",
        "nb": 3
      },
      {
        "id": 66,
        "name": "Machoc",
        "rarity": "common",
        "description": "Un Pokémon de type Combat, avec une force brute impressionnante et une discipline de fer dans son entraînement.",
        "nb": 3
      },
      {
        "id": 67,
        "name": "Machopeur",
        "rarity": "common",
        "description": "L'évolution de Machoc, plus grand et plus fort, il maîtrise des techniques de combat encore plus puissantes.",
        "nb": 2
      },
      {
        "id": 129,
        "name": "Magicarpe",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, connu pour sa faible capacité à se défendre, mais capable de se transformer en Léviator lorsqu'il évolue.",
        "nb": 5
      },
      {
        "id": 81,
        "name": "Magnéti",
        "rarity": "common",
        "description": "Un Pokémon de type Électrique et Acier, ressemblant à un petit aimant, attirant les objets métalliques autour de lui.",
        "nb": 3
      },
      {
        "id": 35,
        "name": "Mélofée",
        "rarity": "common",
        "description": "Un petit Pokémon de type Fée, mignon et espiègle, souvent vu dans des endroits tranquilles comme des prairies.",
        "nb": 6
      },
      {
        "id": 52,
        "name": "Miaouss",
        "rarity": "common",
        "description": "Un Pokémon de type Normal, ressemblant à un petit chat malin, souvent vu en train de voler des objets.",
        "nb": 1
      },
      {
        "id": 48,
        "name": "Mimitoss",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte et Poison, ressemblant à une araignée, qui peut changer d'apparence pour se cacher.",
        "nb": 5
      },
      {
        "id": 43,
        "name": "Mystherbe",
        "rarity": "common",
        "description": "Un Pokémon de type Plante et Poison, ressemblant à une petite herbe qui cache une mystérieuse boule de feu.",
        "nb": 2
      },
      {
        "id": 29,
        "name": "Nidoran♀",
        "rarity": "common",
        "description": "Un petit Pokémon de type Poison, avec des oreilles longues et des piquants sur le dos, généralement timide mais défensif.",
        "nb": 6
      },
      {
        "id": 32,
        "name": "Nidoran♂",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, ressemblant à un petit mâle avec des piquants sur le dos et des instincts combatifs.",
        "nb": 1
      },
      {
        "id": 33,
        "name": "Nidorino",
        "rarity": "common",
        "description": "L'évolution de Nidoran♂, un Pokémon plus fort avec des cornes redoutables et une personnalité plus agressive.",
        "nb": 3
      },
      {
        "id": 102,
        "name": "Noeunoeuf",
        "rarity": "common",
        "description": "Un Pokémon de type Plante ressemblant à un œuf de Pâques, qui peut se diviser en plusieurs œufs plus petits.",
        "nb": 1
      },
      {
        "id": 42,
        "name": "Nosferalto",
        "rarity": "common",
        "description": "L'évolution de Nosferapti, une chauve-souris plus grande et plus redoutable, capable de voler à haute vitesse.",
        "nb": 1
      },
      {
        "id": 41,
        "name": "Nosferapti",
        "rarity": "common",
        "description": "Un Pokémon de type Poison et Vol, ressemblant à une chauve-souris, qui se nourrit de sang et vole dans l'obscurité.",
        "nb": 6
      },
      {
        "id": 44,
        "name": "Ortide",
        "rarity": "common",
        "description": "L'évolution de Mystherbe, une plante avec des pétales parfumées, capable de libérer des spores toxiques.",
        "nb": 4
      },
      {
        "id": 104,
        "name": "Osselait",
        "rarity": "common",
        "description": "Un Pokémon de type Sol, ressemblant à un squelette de dinosaure qui erre lentement à la recherche de nourriture.",
        "nb": 8
      },
      {
        "id": 86,
        "name": "Otaria",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un phoque, qui passe son temps à jouer et à se prélasser sur les plages.",
        "nb": 10
      },
      {
        "id": 46,
        "name": "Paras",
        "rarity": "common",
        "description": "Un petit Pokémon de type Insecte et Plante, portant des champignons parasitaires sur son dos.",
        "nb": 6
      },
      {
        "id": 21,
        "name": "Piafabec",
        "rarity": "common",
        "description": "Un petit Pokémon de type Vol, ressemblant à un oiseau avec un bec très pointu, souvent vu dans les forêts.",
        "nb": 2
      },
      {
        "id": 118,
        "name": "Poissirène",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un petit poisson coloré, vivant dans les eaux peu profondes des rivières et des lacs.",
        "nb": 4
      },
      {
        "id": 77,
        "name": "Ponyta",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu, ressemblant à un cheval avec une crinière en flammes qui brûle constamment.",
        "nb": 3
      },
      {
        "id": 54,
        "name": "Psykokwak",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un canard, souvent pris de maux de tête qui déclenchent de puissantes attaques psychiques.",
        "nb": 5
      },
      {
        "id": 60,
        "name": "Ptitard",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un têtard, souvent vu nageant dans les étangs.",
        "nb": 5
      },
      {
        "id": 74,
        "name": "Racaillou",
        "rarity": "common",
        "description": "Un Pokémon de type Roche et Sol, ressemblant à un petit rocher qui peut se déplacer lentement sur le sol.",
        "nb": 3
      },
      {
        "id": 79,
        "name": "Ramoloss",
        "rarity": "common",
        "description": "Un Pokémon de type Eau et Psychique, ressemblant à une créature molle et paresseuse, souvent vu flottant sans but.",
        "nb": 4
      },
      {
        "id": 19,
        "name": "Rattata",
        "rarity": "common",
        "description": "Un petit Pokémon de type Normal, ressemblant à un rat, souvent vu dans des zones urbaines.",
        "nb": 1
      },
      {
        "id": 20,
        "name": "Rattatac",
        "rarity": "common",
        "description": "L'évolution de Rattata, un rat plus rapide et plus agressif avec des crocs puissants.",
        "nb": 6
      },
      {
        "id": 5,
        "name": "Reptincel",
        "rarity": "common",
        "description": "L'évolution de Salamèche, un Pokémon plus agressif avec des flammes plus puissantes.",
        "nb": 3
      },
      {
        "id": 111,
        "name": "Rhinocorne",
        "rarity": "common",
        "description": "Un Pokémon de type Sol et Roche, ressemblant à un rhinocéros, avec une corne dure qu'il utilise pour attaquer ses adversaires.",
        "nb": 3
      },
      {
        "id": 39,
        "name": "Rondoudou",
        "rarity": "common",
        "description": "Un Pokémon de type Fée et Normal, rond et mignon, capable de chanter pour endormir ses adversaires.",
        "nb": 3
      },
      {
        "id": 16,
        "name": "Roucool",
        "rarity": "common",
        "description": "Un Pokémon de type Vol, souvent vu dans les villes, c'est un petit oiseau agile.",
        "nb": 1
      },
      {
        "id": 17,
        "name": "Roucoups",
        "rarity": "common",
        "description": "L'évolution de Roucool, un oiseau plus fort et plus rapide, souvent utilisé pour ses compétences en vol.",
        "nb": 5
      },
      {
        "id": 27,
        "name": "Sabelette",
        "rarity": "common",
        "description": "Un petit Pokémon de type Sol, ressemblant à un furet, qui creuse des tunnels à grande vitesse.",
        "nb": 4
      },
      {
        "id": 4,
        "name": "Salamèche",
        "rarity": "common",
        "description": "Un Pokémon de type Feu, avec une flamme allumée au bout de sa queue.",
        "nb": 3
      },
      {
        "id": 109,
        "name": "Smogo",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, composé de gaz toxiques et d'un corps flottant, souvent utilisé pour répandre des toxines dans son environnement.",
        "nb": 5
      },
      {
        "id": 96,
        "name": "Soporifik",
        "rarity": "common",
        "description": "Un Pokémon de type Psychique, ressemblant à un petit personnage endormi, capable d'endormir ses ennemis avec ses pouvoirs.",
        "nb": 3
      },
      {
        "id": 93,
        "name": "Spectrum",
        "rarity": "common",
        "description": "L'évolution de Fantominus, un Pokémon plus tangible, capable de se rendre invisible et d'effrayer ses ennemis.",
        "nb": 1
      },
      {
        "id": 120,
        "name": "Stari",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une étoile de mer qui se déplace lentement sous l'eau, utilisant ses bras pour se propulser.",
        "nb": 4
      },
      {
        "id": 88,
        "name": "Tadmorv",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, semblable à une masse de boue qui peut se déformer et se déplacer lentement.",
        "nb": 1
      },
      {
        "id": 50,
        "name": "Taupiqueur",
        "rarity": "common",
        "description": "Un petit Pokémon de type Sol, ressemblant à un taupe, qui creuse rapidement des tunnels sous terre.",
        "nb": 1
      },
      {
        "id": 72,
        "name": "Tentacool",
        "rarity": "common",
        "description": "Un Pokémon de type Eau et Poison, ressemblant à une méduse, qui flotte à la surface des océans et des mers.",
        "nb": 3
      },
      {
        "id": 61,
        "name": "Têtarte",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un têtard, qui nage et grandit dans des étangs ou des rivières.",
        "nb": 5
      },
      {
        "id": 100,
        "name": "Voltorbe",
        "rarity": "common",
        "description": "Un Pokémon de type Électrique, ressemblant à une balle ronde qui roule à grande vitesse, souvent associé aux pannes de courant.",
        "nb": 2
      },
      {
        "id": 49,
        "name": "Aéromite",
        "rarity": "rare",
        "description": "L'évolution de Mimitoss, une araignée plus grande et plus agile, capable de générer des vents puissants pour se défendre.",
        "nb": 1
      },
      {
        "id": 83,
        "name": "Canarticho",
        "rarity": "rare",
        "description": "Un Pokémon de type Vol et Normal, ressemblant à une oie qui peut rapidement se déplacer en battant des ailes puissantes.",
        "nb": 1
      },
      {
        "id": 15,
        "name": "Dardargnan",
        "rarity": "rare",
        "description": "L'évolution finale d'Aspicot, un Pokémon insecte agressif avec des dards prêts à piquer.",
        "nb": 1
      },
      {
        "id": 85,
        "name": "Dodrio",
        "rarity": "rare",
        "description": "L'évolution de Doduo, un Pokémon à trois têtes, chacune possédant sa propre personnalité et capable de courir encore plus vite.",
        "nb": 1
      },
      {
        "id": 148,
        "name": "Draco",
        "rarity": "rare",
        "description": "Un Pokémon de type Dragon, connu pour sa grande puissance et ses capacités de combat impressionnantes. Il est la forme intermédiaire de Minidraco.",
        "nb": 1
      },
      {
        "id": 94,
        "name": "Ectoplasma",
        "rarity": "rare",
        "description": "L'évolution finale de Fantominus et Spectrum, un Pokémon de type Spectre et Poison extrêmement puissant, capable de détruire tout sur son passage.",
        "nb": 2
      },
      {
        "id": 125,
        "name": "Élektek",
        "rarity": "rare",
        "description": "Un Pokémon de type Électrik, connu pour son corps générant des décharges électriques puissantes et sa vitesse fulgurante.",
        "nb": 1
      },
      {
        "id": 108,
        "name": "Excelangue",
        "rarity": "rare",
        "description": "Un Pokémon à langue extrêmement longue qui utilise sa capacité pour attraper sa nourriture à distance et interagir avec son environnement.",
        "nb": 2
      },
      {
        "id": 78,
        "name": "Galopa",
        "rarity": "rare",
        "description": "L'évolution de Ponyta, un cheval majestueux de feu, capable de courir à des vitesses incroyables tout en créant des flammes sur son passage.",
        "nb": 1
      },
      {
        "id": 89,
        "name": "Grotadmorv",
        "rarity": "rare",
        "description": "L'évolution de Tadmorv, une créature plus imposante et malodorante, capable de libérer des gaz toxiques.",
        "nb": 1
      },
      {
        "id": 123,
        "name": "Insécateur",
        "rarity": "rare",
        "description": "Un Pokémon de type Insecte/Vol, qui ressemble à un insecte préhistorique avec des ailes et des pinces tranchantes.",
        "nb": 1
      },
      {
        "id": 106,
        "name": "Kicklee",
        "rarity": "rare",
        "description": "Un Pokémon de type Combat, maître des arts martiaux, qui peut se déplacer avec une agilité impressionnante et effectuer des coups puissants.",
        "nb": 1
      },
      {
        "id": 87,
        "name": "Lamantine",
        "rarity": "rare",
        "description": "L'évolution d'Otaria, un énorme mammifère marin de type Eau et Glace, capable de nager à grande vitesse dans les mers froides.",
        "nb": 3
      },
      {
        "id": 130,
        "name": "Léviator",
        "rarity": "rare",
        "description": "L'évolution de Magicarpe, un Pokémon de type Eau/Vol imposant, capable de provoquer des tempêtes et de détruire des environnements avec sa puissance.",
        "nb": 1
      },
      {
        "id": 82,
        "name": "Magnéton",
        "rarity": "rare",
        "description": "L'évolution de Magnéti, un trio d'aimants qui se regroupent pour former un seul Pokémon de type Électrique et Acier.",
        "nb": 1
      },
      {
        "id": 34,
        "name": "Nidoking",
        "rarity": "rare",
        "description": "L'évolution finale de Nidoran♂, un grand Pokémon de type Poison et Sol, puissant et capable de détruire ses ennemis avec ses coups de poing.",
        "nb": 3
      },
      {
        "id": 103,
        "name": "Noadkoko",
        "rarity": "rare",
        "description": "L'évolution de Noeunoeuf, un Pokémon en forme de palmier avec de nombreux œufs sur ses branches.",
        "nb": 1
      },
      {
        "id": 95,
        "name": "Onix",
        "rarity": "rare",
        "description": "Un Pokémon de type Roche et Sol, ressemblant à un énorme serpent fait de roches qui se déplace rapidement sous terre.",
        "nb": 3
      },
      {
        "id": 105,
        "name": "Ossatueur",
        "rarity": "rare",
        "description": "L'évolution d'Osselait, un grand Pokémon de type Sol avec un squelette imposant, capable de se défendre grâce à ses os.",
        "nb": 1
      },
      {
        "id": 47,
        "name": "Parasect",
        "rarity": "rare",
        "description": "L'évolution de Paras, un Pokémon avec des champignons encore plus gros, qui peuvent avoir un effet toxique sur ses adversaires.",
        "nb": 1
      },
      {
        "id": 53,
        "name": "Persian",
        "rarity": "rare",
        "description": "L'évolution de Miaouss, un chat élégant et rapide, souvent apprécié pour sa beauté et sa grâce.",
        "nb": 1
      },
      {
        "id": 119,
        "name": "Poissoroy",
        "rarity": "rare",
        "description": "L'évolution de Poissirène, un poisson d'eau salée doté d'une grande puissance, capable de nager rapidement et de créer des tourments dans les mers.",
        "nb": 1
      },
      {
        "id": 18,
        "name": "Roucarnage",
        "rarity": "rare",
        "description": "L'évolution finale de Roucool, un grand oiseau de combat avec des ailes imposantes et un bec acéré.",
        "nb": 1
      },
      {
        "id": 110,
        "name": "Smogogo",
        "rarity": "rare",
        "description": "L'évolution de Smogo, un Pokémon encore plus massif et toxique, capable de produire des nuages de gaz vénéneux autour de lui.",
        "nb": 2
      },
      {
        "id": 121,
        "name": "Staross",
        "rarity": "rare",
        "description": "L'évolution de Stari, un Pokémon de type Eau/Psychique en forme d'étoile à cinq branches, capable de se déplacer à grande vitesse.",
        "nb": 2
      },
      {
        "id": 62,
        "name": "Tartard",
        "rarity": "rare",
        "description": "L'évolution de Têtarte, une créature plus grande avec des puissantes mâchoires et capable de manipuler l'eau avec facilité.",
        "nb": 1
      },
      {
        "id": 9,
        "name": "Tortank",
        "rarity": "rare",
        "description": "L'évolution finale de Carapuce, une énorme tortue de guerre avec un canon d'eau sur le dos.",
        "nb": 1
      },
      {
        "id": 107,
        "name": "Tygnon",
        "rarity": "rare",
        "description": "Un Pokémon de type Combat, réputé pour sa force physique brute et ses incroyables compétences en boxe.",
        "nb": 4
      },
      {
        "id": 135,
        "name": "Voltali",
        "rarity": "rare",
        "description": "L'évolution de Évoli, un Pokémon de type Électrik qui génère des décharges électriques à partir de son corps.",
        "nb": 2
      },
      {
        "id": 139,
        "name": "Amonistar",
        "rarity": "legendary",
        "description": "L'évolution d'Amonita, un Pokémon préhistorique de type Roche/Eau, qui utilise ses tentacules pour attraper sa proie.",
        "nb": 3
      },
      {
        "id": 138,
        "name": "Amonita",
        "rarity": "legendary",
        "description": "Un Pokémon de type Roche/Eau fossile, ressemblant à un ammonite, qui a vécu il y a des millions d'années et a été ressuscité par un fossile.",
        "nb": 2
      },
      {
        "id": 144,
        "name": "Artikodin",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Glace/Vol, considéré comme l'un des oiseaux légendaires. Il est capable de créer des tempêtes de glace et de contrôler la neige.",
        "nb": 2
      },
      {
        "id": 149,
        "name": "Dracolosse",
        "rarity": "legendary",
        "description": "L'évolution finale de Minidraco, un Pokémon de type Dragon/Vol légendaire. Il est majestueux et possède une grande puissance, capable de voler et de lutter contre des adversaires redoutables.",
        "nb": 1
      },
      {
        "id": 145,
        "name": "Électhor",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Électrik/Vol, l'un des trois oiseaux légendaires, capable de contrôler l'électricité et de provoquer des tempêtes électriques.",
        "nb": 1
      },
      {
        "id": 140,
        "name": "Kabuto",
        "rarity": "legendary",
        "description": "Un Pokémon de type Roche/Eau fossile ressemblant à une crevette, qui a été ressuscité à partir d'un fossile et est un prédateur aquatique agile.",
        "nb": 2
      },
      {
        "id": 141,
        "name": "Kabutops",
        "rarity": "legendary",
        "description": "L'évolution de Kabuto, un Pokémon de type Roche/Eau avec une apparence de prédateur aquatique, connu pour ses griffes acérées et sa rapidité.",
        "nb": 1
      },
      {
        "id": 115,
        "name": "Kangourex",
        "rarity": "legendary",
        "description": "Un Pokémon de type Normal, ressemblant à un kangourou. Il porte son petit dans sa poche ventrale et protège farouchement sa progéniture.",
        "nb": 1
      },
      {
        "id": 113,
        "name": "Leveinard",
        "rarity": "legendary",
        "description": "Un Pokémon de type Normal, connu pour sa grande capacité à soigner et son caractère aimant. Il garde souvent des œufs d'une grande valeur.",
        "nb": 2
      },
      {
        "id": 131,
        "name": "Lokhlass",
        "rarity": "legendary",
        "description": "Un Pokémon de type Eau/Glace légendaire, ressemblant à un grand serpent marin qui hante les eaux glacées.",
        "nb": 3
      },
      {
        "id": 150,
        "name": "Mewtwo",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Psy, créé génétiquement à partir de Mew. Il possède une intelligence supérieure et des pouvoirs psychiques extrêmement puissants.",
        "nb": 2
      }
    ],
    "lastBooster": 1747723544915,
    "token": "fe8cbhehhcfieg"
  },
  {
    "id": 2,
    "username": "raphoulouloufougerou",
    "password": "$2b$10$1HNjqLoEuyDclvhU6fwGPuFsLJdPzOT/4bLkWYCalpB47qGlqNR2O",
    "currency": 0,
    "collection": [
      {
        "id": 23,
        "name": "Abo",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, ressemblant à un serpent, souvent vu enroulé sur lui-même.",
        "nb": 1
      },
      {
        "id": 63,
        "name": "Abra",
        "rarity": "common",
        "description": "Un Pokémon de type Psychique, connu pour sa capacité à se téléporter dès qu'il se sent menacé.",
        "nb": 5
      },
      {
        "id": 13,
        "name": "Aspicot",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte et Poison, ressemblant à une petite chenille avec des épines sur son dos.",
        "nb": 3
      },
      {
        "id": 70,
        "name": "Boustiflor",
        "rarity": "common",
        "description": "L'évolution de Chétiflor, un Pokémon avec des pétales plus gros et un caractère plus agressif, capable de libérer des spores toxiques.",
        "nb": 7
      },
      {
        "id": 1,
        "name": "Bulbizarre",
        "rarity": "common",
        "description": "Un Pokémon de type Plante et Poison, souvent vu avec un bulbe sur son dos qui deviendra une grande fleur.",
        "nb": 5
      },
      {
        "id": 58,
        "name": "Caninos",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu, ressemblant à un chien, avec une fourrure chaude et une personnalité amicale.",
        "nb": 2
      },
      {
        "id": 8,
        "name": "Carabaffe",
        "rarity": "common",
        "description": "L'évolution de Carapuce, une tortue plus grande et plus robuste.",
        "nb": 6
      },
      {
        "id": 7,
        "name": "Carapuce",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une petite tortue avec une coquille solide.",
        "nb": 2
      },
      {
        "id": 10,
        "name": "Chenipan",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte, ressemblant à une chenille verte, souvent trouvé dans des endroits boisés.",
        "nb": 4
      },
      {
        "id": 69,
        "name": "Chétiflor",
        "rarity": "common",
        "description": "Un Pokémon de type Plante, ressemblant à une petite plante fleurie, souvent trouvé dans les prairies et les bois.",
        "nb": 1
      },
      {
        "id": 11,
        "name": "Chrysacier",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte, souvent vu sous forme de cocon avant de se transformer en Papilusion.",
        "nb": 2
      },
      {
        "id": 14,
        "name": "Coconfort",
        "rarity": "common",
        "description": "L'évolution d'Aspicot, un cocon solide qui protège l'insecte avant sa métamorphose en Dardargnan.",
        "nb": 11
      },
      {
        "id": 84,
        "name": "Doduo",
        "rarity": "common",
        "description": "Un Pokémon à deux têtes et à deux corps, de type Normal et Vol, qui court à une vitesse incroyable.",
        "nb": 2
      },
      {
        "id": 133,
        "name": "Évoli",
        "rarity": "common",
        "description": "Un Pokémon de type Normal, capable d'évoluer en plusieurs formes selon le type d'évolution choisi par son dresseur.",
        "nb": 5
      },
      {
        "id": 92,
        "name": "Fantominus",
        "rarity": "common",
        "description": "Un Pokémon de type Spectre et Poison, ressemblant à un fantôme qui flotte dans les airs et peut traverser les murs.",
        "nb": 7
      },
      {
        "id": 56,
        "name": "Férosinge",
        "rarity": "common",
        "description": "Un Pokémon de type Combat, ressemblant à un petit singe, agile et toujours prêt à se battre.",
        "nb": 2
      },
      {
        "id": 37,
        "name": "Goupix",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu ressemblant à un renard, avec une queue touffue et une fourrure chaude.",
        "nb": 10
      },
      {
        "id": 75,
        "name": "Gravalanch",
        "rarity": "common",
        "description": "L'évolution de Racaillou, plus imposant et plus solide, avec des pierres pointues recouvrant son corps.",
        "nb": 5
      },
      {
        "id": 2,
        "name": "Herbizarre",
        "rarity": "common",
        "description": "L'évolution de Bulbizarre, un Pokémon à l'apparence plus végétale avec des branches florales.",
        "nb": 4
      },
      {
        "id": 116,
        "name": "Hypotrempe",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une petite créature aquatique, qui se déplace en glissant dans l'eau.",
        "nb": 9
      },
      {
        "id": 64,
        "name": "Kadabra",
        "rarity": "common",
        "description": "L'évolution d'Abra, un Pokémon avec des pouvoirs psychiques beaucoup plus développés, capable de lancer des attaques puissantes.",
        "nb": 6
      },
      {
        "id": 90,
        "name": "Kokiyas",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une coquille, qui se cache à l'intérieur de son coquillage pour se protéger.",
        "nb": 9
      },
      {
        "id": 98,
        "name": "Krabby",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un crabe, qui vit sur les plages et se cache sous les rochers.",
        "nb": 4
      },
      {
        "id": 66,
        "name": "Machoc",
        "rarity": "common",
        "description": "Un Pokémon de type Combat, avec une force brute impressionnante et une discipline de fer dans son entraînement.",
        "nb": 5
      },
      {
        "id": 67,
        "name": "Machopeur",
        "rarity": "common",
        "description": "L'évolution de Machoc, plus grand et plus fort, il maîtrise des techniques de combat encore plus puissantes.",
        "nb": 10
      },
      {
        "id": 129,
        "name": "Magicarpe",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, connu pour sa faible capacité à se défendre, mais capable de se transformer en Léviator lorsqu'il évolue.",
        "nb": 5
      },
      {
        "id": 81,
        "name": "Magnéti",
        "rarity": "common",
        "description": "Un Pokémon de type Électrique et Acier, ressemblant à un petit aimant, attirant les objets métalliques autour de lui.",
        "nb": 3
      },
      {
        "id": 35,
        "name": "Mélofée",
        "rarity": "common",
        "description": "Un petit Pokémon de type Fée, mignon et espiègle, souvent vu dans des endroits tranquilles comme des prairies.",
        "nb": 6
      },
      {
        "id": 52,
        "name": "Miaouss",
        "rarity": "common",
        "description": "Un Pokémon de type Normal, ressemblant à un petit chat malin, souvent vu en train de voler des objets.",
        "nb": 7
      },
      {
        "id": 48,
        "name": "Mimitoss",
        "rarity": "common",
        "description": "Un Pokémon de type Insecte et Poison, ressemblant à une araignée, qui peut changer d'apparence pour se cacher.",
        "nb": 9
      },
      {
        "id": 43,
        "name": "Mystherbe",
        "rarity": "common",
        "description": "Un Pokémon de type Plante et Poison, ressemblant à une petite herbe qui cache une mystérieuse boule de feu.",
        "nb": 4
      },
      {
        "id": 29,
        "name": "Nidoran♀",
        "rarity": "common",
        "description": "Un petit Pokémon de type Poison, avec des oreilles longues et des piquants sur le dos, généralement timide mais défensif.",
        "nb": 5
      },
      {
        "id": 32,
        "name": "Nidoran♂",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, ressemblant à un petit mâle avec des piquants sur le dos et des instincts combatifs.",
        "nb": 2
      },
      {
        "id": 30,
        "name": "Nidorina",
        "rarity": "common",
        "description": "L'évolution de Nidoran♀, un Pokémon plus agressif avec des griffes et des piquants sur le corps pour se défendre.",
        "nb": 5
      },
      {
        "id": 33,
        "name": "Nidorino",
        "rarity": "common",
        "description": "L'évolution de Nidoran♂, un Pokémon plus fort avec des cornes redoutables et une personnalité plus agressive.",
        "nb": 9
      },
      {
        "id": 102,
        "name": "Noeunoeuf",
        "rarity": "common",
        "description": "Un Pokémon de type Plante ressemblant à un œuf de Pâques, qui peut se diviser en plusieurs œufs plus petits.",
        "nb": 5
      },
      {
        "id": 42,
        "name": "Nosferalto",
        "rarity": "common",
        "description": "L'évolution de Nosferapti, une chauve-souris plus grande et plus redoutable, capable de voler à haute vitesse.",
        "nb": 4
      },
      {
        "id": 41,
        "name": "Nosferapti",
        "rarity": "common",
        "description": "Un Pokémon de type Poison et Vol, ressemblant à une chauve-souris, qui se nourrit de sang et vole dans l'obscurité.",
        "nb": 2
      },
      {
        "id": 44,
        "name": "Ortide",
        "rarity": "common",
        "description": "L'évolution de Mystherbe, une plante avec des pétales parfumées, capable de libérer des spores toxiques.",
        "nb": 2
      },
      {
        "id": 104,
        "name": "Osselait",
        "rarity": "common",
        "description": "Un Pokémon de type Sol, ressemblant à un squelette de dinosaure qui erre lentement à la recherche de nourriture.",
        "nb": 13
      },
      {
        "id": 86,
        "name": "Otaria",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un phoque, qui passe son temps à jouer et à se prélasser sur les plages.",
        "nb": 2
      },
      {
        "id": 46,
        "name": "Paras",
        "rarity": "common",
        "description": "Un petit Pokémon de type Insecte et Plante, portant des champignons parasitaires sur son dos.",
        "nb": 6
      },
      {
        "id": 21,
        "name": "Piafabec",
        "rarity": "common",
        "description": "Un petit Pokémon de type Vol, ressemblant à un oiseau avec un bec très pointu, souvent vu dans les forêts.",
        "nb": 4
      },
      {
        "id": 25,
        "name": "Pikachu",
        "rarity": "common",
        "description": "Le célèbre Pokémon de type Électrik, petit et mignon, avec des joues capables de libérer des décharges électriques.",
        "nb": 1
      },
      {
        "id": 118,
        "name": "Poissirène",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un petit poisson coloré, vivant dans les eaux peu profondes des rivières et des lacs.",
        "nb": 8
      },
      {
        "id": 77,
        "name": "Ponyta",
        "rarity": "common",
        "description": "Un petit Pokémon de type Feu, ressemblant à un cheval avec une crinière en flammes qui brûle constamment.",
        "nb": 4
      },
      {
        "id": 54,
        "name": "Psykokwak",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à un canard, souvent pris de maux de tête qui déclenchent de puissantes attaques psychiques.",
        "nb": 5
      },
      {
        "id": 60,
        "name": "Ptitard",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un têtard, souvent vu nageant dans les étangs.",
        "nb": 6
      },
      {
        "id": 74,
        "name": "Racaillou",
        "rarity": "common",
        "description": "Un Pokémon de type Roche et Sol, ressemblant à un petit rocher qui peut se déplacer lentement sur le sol.",
        "nb": 9
      },
      {
        "id": 79,
        "name": "Ramoloss",
        "rarity": "common",
        "description": "Un Pokémon de type Eau et Psychique, ressemblant à une créature molle et paresseuse, souvent vu flottant sans but.",
        "nb": 6
      },
      {
        "id": 19,
        "name": "Rattata",
        "rarity": "common",
        "description": "Un petit Pokémon de type Normal, ressemblant à un rat, souvent vu dans des zones urbaines.",
        "nb": 6
      },
      {
        "id": 20,
        "name": "Rattatac",
        "rarity": "common",
        "description": "L'évolution de Rattata, un rat plus rapide et plus agressif avec des crocs puissants.",
        "nb": 7
      },
      {
        "id": 5,
        "name": "Reptincel",
        "rarity": "common",
        "description": "L'évolution de Salamèche, un Pokémon plus agressif avec des flammes plus puissantes.",
        "nb": 4
      },
      {
        "id": 111,
        "name": "Rhinocorne",
        "rarity": "common",
        "description": "Un Pokémon de type Sol et Roche, ressemblant à un rhinocéros, avec une corne dure qu'il utilise pour attaquer ses adversaires.",
        "nb": 6
      },
      {
        "id": 39,
        "name": "Rondoudou",
        "rarity": "common",
        "description": "Un Pokémon de type Fée et Normal, rond et mignon, capable de chanter pour endormir ses adversaires.",
        "nb": 5
      },
      {
        "id": 16,
        "name": "Roucool",
        "rarity": "common",
        "description": "Un Pokémon de type Vol, souvent vu dans les villes, c'est un petit oiseau agile.",
        "nb": 5
      },
      {
        "id": 17,
        "name": "Roucoups",
        "rarity": "common",
        "description": "L'évolution de Roucool, un oiseau plus fort et plus rapide, souvent utilisé pour ses compétences en vol.",
        "nb": 6
      },
      {
        "id": 27,
        "name": "Sabelette",
        "rarity": "common",
        "description": "Un petit Pokémon de type Sol, ressemblant à un furet, qui creuse des tunnels à grande vitesse.",
        "nb": 8
      },
      {
        "id": 4,
        "name": "Salamèche",
        "rarity": "common",
        "description": "Un Pokémon de type Feu, avec une flamme allumée au bout de sa queue.",
        "nb": 6
      },
      {
        "id": 109,
        "name": "Smogo",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, composé de gaz toxiques et d'un corps flottant, souvent utilisé pour répandre des toxines dans son environnement.",
        "nb": 6
      },
      {
        "id": 96,
        "name": "Soporifik",
        "rarity": "common",
        "description": "Un Pokémon de type Psychique, ressemblant à un petit personnage endormi, capable d'endormir ses ennemis avec ses pouvoirs.",
        "nb": 2
      },
      {
        "id": 93,
        "name": "Spectrum",
        "rarity": "common",
        "description": "L'évolution de Fantominus, un Pokémon plus tangible, capable de se rendre invisible et d'effrayer ses ennemis.",
        "nb": 5
      },
      {
        "id": 120,
        "name": "Stari",
        "rarity": "common",
        "description": "Un Pokémon de type Eau, ressemblant à une étoile de mer qui se déplace lentement sous l'eau, utilisant ses bras pour se propulser.",
        "nb": 3
      },
      {
        "id": 88,
        "name": "Tadmorv",
        "rarity": "common",
        "description": "Un Pokémon de type Poison, semblable à une masse de boue qui peut se déformer et se déplacer lentement.",
        "nb": 6
      },
      {
        "id": 50,
        "name": "Taupiqueur",
        "rarity": "common",
        "description": "Un petit Pokémon de type Sol, ressemblant à un taupe, qui creuse rapidement des tunnels sous terre.",
        "nb": 2
      },
      {
        "id": 72,
        "name": "Tentacool",
        "rarity": "common",
        "description": "Un Pokémon de type Eau et Poison, ressemblant à une méduse, qui flotte à la surface des océans et des mers.",
        "nb": 8
      },
      {
        "id": 61,
        "name": "Têtarte",
        "rarity": "common",
        "description": "Un petit Pokémon de type Eau, ressemblant à un têtard, qui nage et grandit dans des étangs ou des rivières.",
        "nb": 3
      },
      {
        "id": 100,
        "name": "Voltorbe",
        "rarity": "common",
        "description": "Un Pokémon de type Électrique, ressemblant à une balle ronde qui roule à grande vitesse, souvent associé aux pannes de courant.",
        "nb": 7
      },
      {
        "id": 65,
        "name": "Alakazam",
        "rarity": "rare",
        "description": "L'évolution finale d'Abra, un Pokémon extrêmement intelligent et rapide, avec des pouvoirs psychiques d'une grande puissance.",
        "nb": 1
      },
      {
        "id": 134,
        "name": "Aquali",
        "rarity": "rare",
        "description": "L'évolution de Évoli, un Pokémon de type Eau avec une nage fluide et la capacité de contrôler les eaux.",
        "nb": 3
      },
      {
        "id": 59,
        "name": "Arcanin",
        "rarity": "rare",
        "description": "L'évolution de Caninos, un grand chien de feu majestueux et loyal, avec une grande vitesse et une puissance redoutable.",
        "nb": 2
      },
      {
        "id": 83,
        "name": "Canarticho",
        "rarity": "rare",
        "description": "Un Pokémon de type Vol et Normal, ressemblant à une oie qui peut rapidement se déplacer en battant des ailes puissantes.",
        "nb": 3
      },
      {
        "id": 57,
        "name": "Colossinge",
        "rarity": "rare",
        "description": "L'évolution de Férosinge, un singe plus grand et plus puissant, maîtrisant des techniques de combat impressionnantes.",
        "nb": 1
      },
      {
        "id": 6,
        "name": "Dracaufeu",
        "rarity": "rare",
        "description": "L'évolution finale de Salamèche, un puissant dragon de feu capable de cracher des flammes énormes.",
        "nb": 3
      },
      {
        "id": 148,
        "name": "Draco",
        "rarity": "rare",
        "description": "Un Pokémon de type Dragon, connu pour sa grande puissance et ses capacités de combat impressionnantes. Il est la forme intermédiaire de Minidraco.",
        "nb": 1
      },
      {
        "id": 94,
        "name": "Ectoplasma",
        "rarity": "rare",
        "description": "L'évolution finale de Fantominus et Spectrum, un Pokémon de type Spectre et Poison extrêmement puissant, capable de détruire tout sur son passage.",
        "nb": 2
      },
      {
        "id": 101,
        "name": "Électrode",
        "rarity": "rare",
        "description": "L'évolution de Voltorbe, un Pokémon sphérique de type Électrique, qui peut exploser lorsqu'il est en danger pour libérer une énorme décharge.",
        "nb": 3
      },
      {
        "id": 125,
        "name": "Élektek",
        "rarity": "rare",
        "description": "Un Pokémon de type Électrik, connu pour son corps générant des décharges électriques puissantes et sa vitesse fulgurante.",
        "nb": 1
      },
      {
        "id": 71,
        "name": "Empiflor",
        "rarity": "rare",
        "description": "L'évolution finale de Chétiflor et Boustiflor, un Pokémon de type Plante et Poison avec de gigantesques fleurs qui libèrent des spores toxiques.",
        "nb": 1
      },
      {
        "id": 108,
        "name": "Excelangue",
        "rarity": "rare",
        "description": "Un Pokémon à langue extrêmement longue qui utilise sa capacité pour attraper sa nourriture à distance et interagir avec son environnement.",
        "nb": 3
      },
      {
        "id": 38,
        "name": "Feunard",
        "rarity": "rare",
        "description": "L'évolution de Goupix, un majestueux renard de feu, doté de plusieurs queues et capable de manipuler les flammes.",
        "nb": 1
      },
      {
        "id": 80,
        "name": "Flagadoss",
        "rarity": "rare",
        "description": "L'évolution de Ramoloss, un Pokémon calme mais extrêmement puissant, capable de maîtriser des pouvoirs psychiques impressionnants.",
        "nb": 1
      },
      {
        "id": 3,
        "name": "Florizarre",
        "rarity": "rare",
        "description": "L'évolution finale de Bulbizarre, un grand Pokémon avec une fleur imposante sur son dos.",
        "nb": 1
      },
      {
        "id": 78,
        "name": "Galopa",
        "rarity": "rare",
        "description": "L'évolution de Ponyta, un cheval majestueux de feu, capable de courir à des vitesses incroyables tout en créant des flammes sur son passage.",
        "nb": 2
      },
      {
        "id": 76,
        "name": "Grolem",
        "rarity": "rare",
        "description": "L'évolution finale de Racaillou et Gravalanch, un Pokémon de type Roche et Sol avec une défense quasiment impénétrable.",
        "nb": 3
      },
      {
        "id": 89,
        "name": "Grotadmorv",
        "rarity": "rare",
        "description": "L'évolution de Tadmorv, une créature plus imposante et malodorante, capable de libérer des gaz toxiques.",
        "nb": 1
      },
      {
        "id": 123,
        "name": "Insécateur",
        "rarity": "rare",
        "description": "Un Pokémon de type Insecte/Vol, qui ressemble à un insecte préhistorique avec des ailes et des pinces tranchantes.",
        "nb": 2
      },
      {
        "id": 130,
        "name": "Léviator",
        "rarity": "rare",
        "description": "L'évolution de Magicarpe, un Pokémon de type Eau/Vol imposant, capable de provoquer des tempêtes et de détruire des environnements avec sa puissance.",
        "nb": 1
      },
      {
        "id": 124,
        "name": "Lippoutou",
        "rarity": "rare",
        "description": "Un Pokémon de type Glace/Psychique inspiré d'un personnage de clown, qui utilise ses pouvoirs psychiques pour manipuler les émotions.",
        "nb": 2
      },
      {
        "id": 122,
        "name": "M. Mime",
        "rarity": "rare",
        "description": "Un Pokémon de type Psy/Fée, connu pour ses pouvoirs psychiques et sa capacité à créer des barrières invisibles.",
        "nb": 1
      },
      {
        "id": 126,
        "name": "Magmar",
        "rarity": "rare",
        "description": "Un Pokémon de type Feu qui est constamment entouré de flammes et peut brûler tout ce qui l'approche.",
        "nb": 1
      },
      {
        "id": 82,
        "name": "Magnéton",
        "rarity": "rare",
        "description": "L'évolution de Magnéti, un trio d'aimants qui se regroupent pour former un seul Pokémon de type Électrique et Acier.",
        "nb": 2
      },
      {
        "id": 36,
        "name": "Mélodelfe",
        "rarity": "rare",
        "description": "L'évolution de Mélofée, un Pokémon plus serein et puissant, capable de chanter des mélodies envoûtantes.",
        "nb": 2
      },
      {
        "id": 147,
        "name": "Minidraco",
        "rarity": "rare",
        "description": "Un petit Pokémon de type Dragon, semblable à un serpent, capable de nager et de voler. Il est l'ancêtre de Draco et Dracolosse.",
        "nb": 1
      },
      {
        "id": 34,
        "name": "Nidoking",
        "rarity": "rare",
        "description": "L'évolution finale de Nidoran♂, un grand Pokémon de type Poison et Sol, puissant et capable de détruire ses ennemis avec ses coups de poing.",
        "nb": 1
      },
      {
        "id": 31,
        "name": "Nidoqueen",
        "rarity": "rare",
        "description": "L'évolution de Nidorina, un Pokémon robuste de type Poison et Sol, souvent vu comme une protectrice de ses œufs.",
        "nb": 1
      },
      {
        "id": 95,
        "name": "Onix",
        "rarity": "rare",
        "description": "Un Pokémon de type Roche et Sol, ressemblant à un énorme serpent fait de roches qui se déplace rapidement sous terre.",
        "nb": 2
      },
      {
        "id": 12,
        "name": "Papilusion",
        "rarity": "rare",
        "description": "L'évolution de Chrysacier, un magnifique papillon aux ailes colorées qui vole gracieusement.",
        "nb": 1
      },
      {
        "id": 47,
        "name": "Parasect",
        "rarity": "rare",
        "description": "L'évolution de Paras, un Pokémon avec des champignons encore plus gros, qui peuvent avoir un effet toxique sur ses adversaires.",
        "nb": 2
      },
      {
        "id": 53,
        "name": "Persian",
        "rarity": "rare",
        "description": "L'évolution de Miaouss, un chat élégant et rapide, souvent apprécié pour sa beauté et sa grâce.",
        "nb": 2
      },
      {
        "id": 22,
        "name": "Rapasdepic",
        "rarity": "rare",
        "description": "L'évolution de Piafabec, un grand oiseau de type Vol et Combat, avec des plumes acérées sur ses ailes.",
        "nb": 1
      },
      {
        "id": 112,
        "name": "Rhinoféros",
        "rarity": "rare",
        "description": "L'évolution de Rhinocorne, un Pokémon imposant et extrêmement puissant, doté d'une défense robuste et d'une corne massive.",
        "nb": 2
      },
      {
        "id": 18,
        "name": "Roucarnage",
        "rarity": "rare",
        "description": "L'évolution finale de Roucool, un grand oiseau de combat avec des ailes imposantes et un bec acéré.",
        "nb": 1
      },
      {
        "id": 28,
        "name": "Sablaireau",
        "rarity": "rare",
        "description": "L'évolution de Sabelette, un Pokémon robuste avec des griffes puissantes pour creuser et un corps résistant.",
        "nb": 1
      },
      {
        "id": 110,
        "name": "Smogogo",
        "rarity": "rare",
        "description": "L'évolution de Smogo, un Pokémon encore plus massif et toxique, capable de produire des nuages de gaz vénéneux autour de lui.",
        "nb": 3
      },
      {
        "id": 121,
        "name": "Staross",
        "rarity": "rare",
        "description": "L'évolution de Stari, un Pokémon de type Eau/Psychique en forme d'étoile à cinq branches, capable de se déplacer à grande vitesse.",
        "nb": 1
      },
      {
        "id": 62,
        "name": "Tartard",
        "rarity": "rare",
        "description": "L'évolution de Têtarte, une créature plus grande avec des puissantes mâchoires et capable de manipuler l'eau avec facilité.",
        "nb": 1
      },
      {
        "id": 128,
        "name": "Tauros",
        "rarity": "rare",
        "description": "Un Pokémon de type Normal ressemblant à un taureau, connu pour sa grande force et sa furie lorsqu'il charge.",
        "nb": 3
      },
      {
        "id": 73,
        "name": "Tentacruel",
        "rarity": "rare",
        "description": "L'évolution de Tentacool, une méduse gigantesque avec des tentacules empoisonnés, capable de nager à grande vitesse.",
        "nb": 1
      },
      {
        "id": 9,
        "name": "Tortank",
        "rarity": "rare",
        "description": "L'évolution finale de Carapuce, une énorme tortue de guerre avec un canon d'eau sur le dos.",
        "nb": 2
      },
      {
        "id": 107,
        "name": "Tygnon",
        "rarity": "rare",
        "description": "Un Pokémon de type Combat, réputé pour sa force physique brute et ses incroyables compétences en boxe.",
        "nb": 2
      },
      {
        "id": 135,
        "name": "Voltali",
        "rarity": "rare",
        "description": "L'évolution de Évoli, un Pokémon de type Électrik qui génère des décharges électriques à partir de son corps.",
        "nb": 1
      },
      {
        "id": 138,
        "name": "Amonita",
        "rarity": "legendary",
        "description": "Un Pokémon de type Roche/Eau fossile, ressemblant à un ammonite, qui a vécu il y a des millions d'années et a été ressuscité par un fossile.",
        "nb": 1
      },
      {
        "id": 144,
        "name": "Artikodin",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Glace/Vol, considéré comme l'un des oiseaux légendaires. Il est capable de créer des tempêtes de glace et de contrôler la neige.",
        "nb": 1
      },
      {
        "id": 149,
        "name": "Dracolosse",
        "rarity": "legendary",
        "description": "L'évolution finale de Minidraco, un Pokémon de type Dragon/Vol légendaire. Il est majestueux et possède une grande puissance, capable de voler et de lutter contre des adversaires redoutables.",
        "nb": 2
      },
      {
        "id": 140,
        "name": "Kabuto",
        "rarity": "legendary",
        "description": "Un Pokémon de type Roche/Eau fossile ressemblant à une crevette, qui a été ressuscité à partir d'un fossile et est un prédateur aquatique agile.",
        "nb": 1
      },
      {
        "id": 115,
        "name": "Kangourex",
        "rarity": "legendary",
        "description": "Un Pokémon de type Normal, ressemblant à un kangourou. Il porte son petit dans sa poche ventrale et protège farouchement sa progéniture.",
        "nb": 1
      },
      {
        "id": 113,
        "name": "Leveinard",
        "rarity": "legendary",
        "description": "Un Pokémon de type Normal, connu pour sa grande capacité à soigner et son caractère aimant. Il garde souvent des œufs d'une grande valeur.",
        "nb": 4
      },
      {
        "id": 131,
        "name": "Lokhlass",
        "rarity": "legendary",
        "description": "Un Pokémon de type Eau/Glace légendaire, ressemblant à un grand serpent marin qui hante les eaux glacées.",
        "nb": 2
      },
      {
        "id": 132,
        "name": "Métamorph",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Normal qui possède la capacité de se transformer en n'importe quel autre Pokémon qu'il voit.",
        "nb": 2
      },
      {
        "id": 151,
        "name": "Mew",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Psy, extrêmement rare et mystérieux. Il possède tous les pouvoirs de tous les autres Pokémon et est capable de se transformer en n'importe quel Pokémon.",
        "nb": 4
      },
      {
        "id": 150,
        "name": "Mewtwo",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Psy, créé génétiquement à partir de Mew. Il possède une intelligence supérieure et des pouvoirs psychiques extrêmement puissants.",
        "nb": 2
      },
      {
        "id": 137,
        "name": "Porygon",
        "rarity": "legendary",
        "description": "Un Pokémon de type Normal, créé artificiellement, capable de se transformer en différentes formes numériques et de naviguer dans des environnements électroniques.",
        "nb": 1
      },
      {
        "id": 143,
        "name": "Ronflex",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Normal, connu pour sa grande taille et son amour du sommeil. Il peut dormir n'importe où et à tout moment.",
        "nb": 1
      },
      {
        "id": 146,
        "name": "Sulfura",
        "rarity": "legendary",
        "description": "Un Pokémon légendaire de type Feu/Vol, l'un des trois oiseaux légendaires, connu pour sa capacité à contrôler les flammes et à incinérer tout sur son passage.",
        "nb": 1
      }
    ],
    "token": "db34bhehbhabii",
    "lastBooster": 1747166762740
  }
]